Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType
ConceptualConstructionType values for Walls.
Since:
2012
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType.NumWallTypeConstruction
Total Number of Wall Type Constructions

Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType.HighMassConstructionNoInsulationInterior
High Mass Construction No Insulation Interior Wall

Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType.HighMassConstructionTypicalMildClimateInsulation
High Mass Construction Typical Mild Climate Insulation Wall

Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType.HighMassConstructionTypicalColdClimateInsulation
High Mass Construction Typical Cold Climate Insulation Wall

Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType.HighMassConstructionHighInsulation
High Mass Construction High Insulation Wall

Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType.LightweightConstructionNoInsulationInterior
Lightweight Construction No Insulation Interior Wall

Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType.LightweightConstructionLowInsulation
Lightweight Construction Low Insulation Wall

Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType.LightweightConstructionTypicalMildClimateInsulation
Lightweight Construction Typical Mild Climate Insulation Wall

Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType.LightweightConstructionTypicalColdClimateInsulation
Lightweight Construction Typical Cold Climate Insulation Wall

Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType.LightweightConstructionHighInsulation
Lightweight Construction High Insulation Wall

Autodesk.Revit.DB.Analysis.ConceptualConstructionWallType.InvalidExteriorWallTypeConstruction
Invalid value/not set Roof Type Construction value